---
title: ElectricalFailures
classe: Autodesk.Revit.DB.BuiltInFailures+ElectricalFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 61
---

# ElectricalFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AllSlotsOnPanelOccupied { get; }` | `ElectricalFailures.AllSlotsOnPanelOccupied` | FailureDefinitionId |
| `FailureDefinitionId BankDistanceSmallerThanDiameter { get; }` | `ElectricalFailures.BankDistanceSmallerThanDiameter` | FailureDefinitionId |
| `FailureDefinitionId CableTrayModified { get; }` | `ElectricalFailures.CableTrayModified` | FailureDefinitionId |
| `FailureDefinitionId CannotAddMorePolesToCircuit { get; }` | `ElectricalFailures.CannotAddMorePolesToCircuit` | FailureDefinitionId |
| `FailureDefinitionId CannotAssignSecondaryDistSysToCircuit { get; }` | `ElectricalFailures.CannotAssignSecondaryDistSysToCircuit` | FailureDefinitionId |
| `FailureDefinitionId CannotConnectDifferentDesignOptsObjects { get; }` | `ElectricalFailures.CannotConnectDifferentDesignOptsObjects` | FailureDefinitionId |
| `FailureDefinitionId CannotCreatePanelScheduleDuetoNoDefaultTemplate { get; }` | `ElectricalFailures.CannotCreatePanelScheduleDuetoNoDefaultTemplate` | FailureDefinitionId |
| `FailureDefinitionId CannotRemoveMembersInCircuitHavingParent { get; }` | `ElectricalFailures.CannotRemoveMembersInCircuitHavingParent` | FailureDefinitionId |
| `FailureDefinitionId CircuitOverload { get; }` | `ElectricalFailures.CircuitOverload` | FailureDefinitionId |
| `FailureDefinitionId CircuitsOverlapAndDeleteSpareSpace { get; }` | `ElectricalFailures.CircuitsOverlapAndDeleteSpareSpace` | FailureDefinitionId |
| `FailureDefinitionId CircuitsOverlapDisconnectCircuits { get; }` | `ElectricalFailures.CircuitsOverlapDisconnectCircuits` | FailureDefinitionId |
| `FailureDefinitionId ConduitModified { get; }` | `ElectricalFailures.ConduitModified` | FailureDefinitionId |
| `FailureDefinitionId ElementsBelongToOtherCircuit { get; }` | `ElectricalFailures.ElementsBelongToOtherCircuit` | FailureDefinitionId |
| `FailureDefinitionId FamilyMismatchCircuit { get; }` | `ElectricalFailures.FamilyMismatchCircuit` | FailureDefinitionId |
| `FailureDefinitionId FeedThroughLugsIsDisabled { get; }` | `ElectricalFailures.FeedThroughLugsIsDisabled` | FailureDefinitionId |
| `FailureDefinitionId FeedThroughLugsIsNotEnabledAndBindFormulaInFamily { get; }` | `ElectricalFailures.FeedThroughLugsIsNotEnabledAndBindFormulaInFamily` | FailureDefinitionId |
| `FailureDefinitionId FeedThroughLugsIsNotEnabledAndBindGlobalParam { get; }` | `ElectricalFailures.FeedThroughLugsIsNotEnabledAndBindGlobalParam` | FailureDefinitionId |
| `FailureDefinitionId FeedThroughLugsIsOccupied { get; }` | `ElectricalFailures.FeedThroughLugsIsOccupied` | FailureDefinitionId |
| `FailureDefinitionId FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits { get; }` | `ElectricalFailures.FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits` | FailureDefinitionId |
| `FailureDefinitionId InvalidApparentPowerDensity { get; }` | `ElectricalFailures.InvalidApparentPowerDensity` | FailureDefinitionId |
| `FailureDefinitionId InvalidNumberOfCircuitValueForDataPanel { get; }` | `ElectricalFailures.InvalidNumberOfCircuitValueForDataPanel` | FailureDefinitionId |
| `FailureDefinitionId InvalidNumberOfCircuitValueForSwitchPanel { get; }` | `ElectricalFailures.InvalidNumberOfCircuitValueForSwitchPanel` | FailureDefinitionId |
| `FailureDefinitionId InvalidNumwiresSinglephase { get; }` | `ElectricalFailures.InvalidNumwiresSinglephase` | FailureDefinitionId |
| `FailureDefinitionId InvalidPathOfParallelConduits { get; }` | `ElectricalFailures.InvalidPathOfParallelConduits` | FailureDefinitionId |
| `FailureDefinitionId MaximumNumberOfPolesExceeded { get; }` | `ElectricalFailures.MaximumNumberOfPolesExceeded` | FailureDefinitionId |
| `FailureDefinitionId MismatchConnectorDistSysToCircuit { get; }` | `ElectricalFailures.MismatchConnectorDistSysToCircuit` | FailureDefinitionId |
| `FailureDefinitionId MismatchDistributionSystem { get; }` | `ElectricalFailures.MismatchDistributionSystem` | FailureDefinitionId |
| `FailureDefinitionId MismatchNmbAssignedDistSysToCircuit { get; }` | `ElectricalFailures.MismatchNmbAssignedDistSysToCircuit` | FailureDefinitionId |
| `FailureDefinitionId MismatchNmbOfPolesToCircuit { get; }` | `ElectricalFailures.MismatchNmbOfPolesToCircuit` | FailureDefinitionId |
| `FailureDefinitionId MismatchPoleBrakesSlotsNumbers { get; }` | `ElectricalFailures.MismatchPoleBrakesSlotsNumbers` | FailureDefinitionId |
| `FailureDefinitionId MismatchVoltageLineToLine { get; }` | `ElectricalFailures.MismatchVoltageLineToLine` | FailureDefinitionId |
| `FailureDefinitionId MismatchVoltageToCircuit { get; }` | `ElectricalFailures.MismatchVoltageToCircuit` | FailureDefinitionId |
| `FailureDefinitionId MissingOrInvalidWireSizeTable { get; }` | `ElectricalFailures.MissingOrInvalidWireSizeTable` | FailureDefinitionId |
| `FailureDefinitionId NoAvailableMatchingConnector { get; }` | `ElectricalFailures.NoAvailableMatchingConnector` | FailureDefinitionId |
| `FailureDefinitionId NoDistributionSystem { get; }` | `ElectricalFailures.NoDistributionSystem` | FailureDefinitionId |
| `FailureDefinitionId NotAllowedCableTrayConduitRotation { get; }` | `ElectricalFailures.NotAllowedCableTrayConduitRotation` | FailureDefinitionId |
| `FailureDefinitionId NotEnoughAvailSlotsAndLugsOnPanel { get; }` | `ElectricalFailures.NotEnoughAvailSlotsAndLugsOnPanel` | FailureDefinitionId |
| `FailureDefinitionId NotEnoughAvailSlotsAndLugsOnSwitchPanel { get; }` | `ElectricalFailures.NotEnoughAvailSlotsAndLugsOnSwitchPanel` | FailureDefinitionId |
| `FailureDefinitionId NotEnoughAvailSlotsOnDataPanel { get; }` | `ElectricalFailures.NotEnoughAvailSlotsOnDataPanel` | FailureDefinitionId |
| `FailureDefinitionId NotEnoughAvailSlotsOnPanel { get; }` | `ElectricalFailures.NotEnoughAvailSlotsOnPanel` | FailureDefinitionId |
| `FailureDefinitionId NotEnoughRoomForParallelConduits { get; }` | `ElectricalFailures.NotEnoughRoomForParallelConduits` | FailureDefinitionId |
| `FailureDefinitionId NotEnoughRoomForParallelPipes { get; }` | `ElectricalFailures.NotEnoughRoomForParallelPipes` | FailureDefinitionId |
| `FailureDefinitionId NotEnoughSlotsOnlyLugAvailable { get; }` | `ElectricalFailures.NotEnoughSlotsOnlyLugAvailable` | FailureDefinitionId |
| `FailureDefinitionId NotEnoughSlotsOnlyLugAvailableForSwitchPanel { get; }` | `ElectricalFailures.NotEnoughSlotsOnlyLugAvailableForSwitchPanel` | FailureDefinitionId |
| `FailureDefinitionId NotPositiveBendRadius { get; }` | `ElectricalFailures.NotPositiveBendRadius` | FailureDefinitionId |
| `FailureDefinitionId NotSupportConcentricBend { get; }` | `ElectricalFailures.NotSupportConcentricBend` | FailureDefinitionId |
| `FailureDefinitionId NumberOfCircuitFullOnSwitchPanel { get; }` | `ElectricalFailures.NumberOfCircuitFullOnSwitchPanel` | FailureDefinitionId |
| `FailureDefinitionId ObjsDemolished { get; }` | `ElectricalFailures.ObjsDemolished` | FailureDefinitionId |
| `FailureDefinitionId PanelMismatchCircuitType { get; }` | `ElectricalFailures.PanelMismatchCircuitType` | FailureDefinitionId |
| `FailureDefinitionId PanelMismatchDistSysWhenCircuitAssigned { get; }` | `ElectricalFailures.PanelMismatchDistSysWhenCircuitAssigned` | FailureDefinitionId |
| `FailureDefinitionId PrimaryNumOfPhasesNotEqualWithSecondary { get; }` | `ElectricalFailures.PrimaryNumOfPhasesNotEqualWithSecondary` | FailureDefinitionId |
| `FailureDefinitionId ReplaceSpareSpaceOnPanelBoard { get; }` | `ElectricalFailures.ReplaceSpareSpaceOnPanelBoard` | FailureDefinitionId |
| `FailureDefinitionId ReplaceSpareSpaceOnSwitchBoard { get; }` | `ElectricalFailures.ReplaceSpareSpaceOnSwitchBoard` | FailureDefinitionId |
| `FailureDefinitionId SecondaryNumOfPhasesNotEqualWithPrimary { get; }` | `ElectricalFailures.SecondaryNumOfPhasesNotEqualWithPrimary` | FailureDefinitionId |
| `FailureDefinitionId SelectedElementsArePartOfOtherCircuit { get; }` | `ElectricalFailures.SelectedElementsArePartOfOtherCircuit` | FailureDefinitionId |
| `FailureDefinitionId SmallBendRadius { get; }` | `ElectricalFailures.SmallBendRadius` | FailureDefinitionId |
| `FailureDefinitionId TransformerNoDistributionSystem { get; }` | `ElectricalFailures.TransformerNoDistributionSystem` | FailureDefinitionId |
| `FailureDefinitionId UnsignedCircuit { get; }` | `ElectricalFailures.UnsignedCircuit` | FailureDefinitionId |
| `FailureDefinitionId UnsupportedTransformerPrimaryDS { get; }` | `ElectricalFailures.UnsupportedTransformerPrimaryDS` | FailureDefinitionId |
| `FailureDefinitionId VoltageIsOutOfRange { get; }` | `ElectricalFailures.VoltageIsOutOfRange` | FailureDefinitionId |
| `FailureDefinitionId WireMaxSizeNonexistent { get; }` | `ElectricalFailures.WireMaxSizeNonexistent` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```